/*
 Navicat Premium Data Transfer

 Source Server         : localhost_3306
 Source Server Type    : MySQL
 Source Server Version : 100424
 Source Host           : localhost:3306
 Source Schema         : test

 Target Server Type    : MySQL
 Target Server Version : 100424
 File Encoding         : 65001

 Date: 24/05/2022 12:09:25
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for todolist
-- ----------------------------
DROP TABLE IF EXISTS `todolist`;
CREATE TABLE `todolist`  (
  `td_id` int(5) NOT NULL AUTO_INCREMENT,
  `empBadgenumber` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL,
  `td_case` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL,
  `td_dept` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL,
  `td_repair` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL,
  `td_insBy` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL,
  `td_insDt` datetime(0) NULL DEFAULT NULL,
  `td_upBy` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL,
  `td_upDt` datetime(0) NULL DEFAULT NULL,
  `td_status` int(1) NULL DEFAULT NULL,
  PRIMARY KEY (`td_id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 58 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of todolist
-- ----------------------------
INSERT INTO `todolist` VALUES (1, '2298', 'เครื่องปริ้นปริ้นไม่ได้', 'อายุกรรมหญิง', 'ทำการ connect เครื่องปริ้นที่อยู่ในวงแลนเดียวกัน', '2298', '2022-05-05 10:22:24', '2298', '2022-05-05 10:22:32', 1);
INSERT INTO `todolist` VALUES (2, '2298', 'ติดตั้งเครื่องปริ้นสติกเกอร์', 'ห้องยาใน', 'ติดตั้งเครื่องปริ้น พร้อมลงไดร์เวอร์ และเซ็ทค่าให้เป็นตัวหลัก', '2298', '2022-05-05 10:22:46', '2298', '2022-05-05 10:22:54', 1);
INSERT INTO `todolist` VALUES (3, '2298', 'เครื่องปริ้นกระดาษติด', 'อายุกรรมชาย', 'ดึงกระดาษ และทำความสะอาดที่ดรั้มหมึกที่มีเศษกระดาษติดอยู่', '2298', '2022-05-05 10:23:11', '2298', '2022-05-05 10:23:21', 1);
INSERT INTO `todolist` VALUES (4, '2298', 'ปริ้น excel ไม่สมส่วน', 'ICU', 'ตั้งค่าหน้ากระดาษให้เหมาะสมกับกระดาษ A4', '2298', '2022-05-05 10:23:45', '2298', '2022-05-05 10:23:53', 1);
INSERT INTO `todolist` VALUES (5, '2298', 'เครื่องปริ้น ปริ้นไม่ได้', 'ห้องผ่าตัด', 'ทำการ connect เครื่องปริ้นที่อยู่ในวงแลนเดียวกัน', '2298', '2022-05-05 10:24:14', '2298', '2022-05-05 10:24:23', 1);
INSERT INTO `todolist` VALUES (6, '2298', 'คอมเปิดไม่ติด กระดาษติดเครื่องปริ้น', 'อายุกรรมชาย', 'ปิดแล้วเปิดใหม่พบว่าวินโดว์อัพเดท, ทำความสะอาดดรั้มหมึกที่มีเศษกระดาษติดอยู่', '2298', '2022-05-05 10:24:36', '2298', '2022-05-05 10:24:43', 1);
INSERT INTO `todolist` VALUES (7, '2298', 'column ใน HosxP หาย', 'ตึกพิเศษ 6 ชั้น 2', 'ลบไฟล์เก่าทิ้งแล้ว แอดไฟล์ใหม่เข้าไป', '2298', '2022-05-05 10:25:04', '2298', '2022-05-05 10:25:21', 1);
INSERT INTO `todolist` VALUES (8, '2298', 'ข้อมูลผู้ป่วยใหม่กรอกข้อมูลผิด', 'อายุกรรมชาย', 'ลบ column ที่ผิดใน hosxP 1 column', '2298', '2022-05-05 10:25:51', '2298', '2022-05-05 10:26:29', 1);
INSERT INTO `todolist` VALUES (9, '2298', 'คอมเปิดไม่ติด', 'เคมี', 'เดินไปตรวจสอบแล้วกดปุ่มปิด แล้วเปิดใหม่ ใช้งานได้ปกติ', '2298', '2022-05-05 14:01:37', '2298', '2022-05-05 14:02:40', 1);
INSERT INTO `todolist` VALUES (10, '2298', 'ผลิตภัณฑ์ ( microsoft ) หมดอายุ', 'cohort', 'activate ให้สามารถกลับมาใช้งานได้ตามปกติ', '2298', '2022-05-05 14:04:07', '2298', '2022-05-05 14:06:12', 1);
INSERT INTO `todolist` VALUES (11, '2298', 'เปิดใช้งาน microsoft powerpoint ไม่ได้', 'ตึกสงฆ์', 'อัพเดท microsoft ให้เป็นเวอร์ชันที่ใหม่ขึ้น จึงสามารถทำให้ใช้งานได้ปกติ', '2298', '2022-05-05 14:19:51', '2298', '2022-05-06 09:01:00', 1);
INSERT INTO `todolist` VALUES (12, '2298', 'คอมเปิดไม่ติด', 'บัญชี', 'พบว่ามีปัญหาที่ Power Supply และคอมยังมีประกันจึงติดต่อให้ประกันมารับเครื่องไปซ่อม เบื้องต้นนำเครื่องสำรองไปให้ใช้ชั่วคราวแล้ว', '2298', '2022-05-05 16:39:10', '2298', '2022-05-06 09:02:35', 1);
INSERT INTO `todolist` VALUES (13, '2298', 'เครื่องปริ้นกระดาษติด', 'อายุกรรมชาย', 'ยกเครื่องปริ้นมาทั้ง 2 เครื่อง และทำการแกะเพื่อทำความสะอาด หยอดน้ำมันเพิ่มความหล่อลื่น ทำให้สามารถใช้งานได้ตามปกติ', '2298', '2022-05-06 09:05:28', '2298', '2022-05-06 09:06:44', 1);
INSERT INTO `todolist` VALUES (14, '2298', 'ให้ connect เครื่องปริ้นให้', 'ER', 'ทำการเชื่อมเครื่องปริ้นจาก .23 กับ .24 ไปที่เครื่อง .25', '2298', '2022-05-06 09:07:44', '2298', '2022-05-06 09:08:35', 1);
INSERT INTO `todolist` VALUES (15, '2298', 'เปิดคอมแล้ว จอไม่แสดงภาพ', 'กลุ่มการพยาบาล', 'ตรวจสอบแล้วพบว่า จอคอมเสีย จึงทำการหาจอสำรองให้ยืมไปให้ใช้ชั่วคราวก่อนเบื้องต้น', '2298', '2022-05-06 09:11:17', '2298', '2022-05-06 09:14:02', 1);
INSERT INTO `todolist` VALUES (16, '2298', 'เครื่องปริ้นกระดาษติด', 'อายุกรรมชาย', 'ทำความสะอาด', '2298', '2022-05-06 09:33:55', '2298', '2022-05-06 09:34:24', 9);
INSERT INTO `todolist` VALUES (17, '2298', 'test', 'test', 'test kub', '2298', '2022-05-06 10:08:56', '2298', '2022-05-06 10:10:57', 9);
INSERT INTO `todolist` VALUES (18, '2298', 'เดินสายแลน', 'จิตเวช', 'เดินสายแลนให้ใหม่ เนื่องจากมีการขยับโต๊ะออกมาใช้งานด้านนอก เดินไว้เป็นระยะทาง 10 เมตร 2 เส้น', '2298', '2022-05-06 15:41:32', '2298', '2022-05-06 15:42:29', 1);
INSERT INTO `todolist` VALUES (19, '2298', 'เสียบไฟแล้วเปิดเครื่องสำรองไฟไม่ติด', 'OPD (ห้องตรวจ 3)', 'ตรวจสอบแล้วแผงวงจรเสียบหายไม่สามารถซ่อมได้ จึงเปลี่ยนเครื่องสำรองไฟให้ โดยนำของสำรองของ OPD ไปเปลี่ยนให้', '2298', '2022-05-09 10:39:48', '2298', '2022-05-09 10:40:53', 1);
INSERT INTO `todolist` VALUES (20, '2298', 'เสียบไฟแล้วเปิดเครื่องสำรองไฟไม่ติด', 'OPD (ห้องตรวจ 8)', 'ตรวจสอบแล้วแผงวงจรเสียบหายไม่สามารถซ่อมได้ จึงเปลี่ยนเครื่องสำรองไฟให้ โดยนำของสำรองของ OPD ไปเปลี่ยนให้', '2298', '2022-05-09 10:41:34', '2298', '2022-05-09 10:52:00', 1);
INSERT INTO `todolist` VALUES (21, '2298', 'เสียบไฟแล้วเปิดเครื่องสำรองไฟไม่ติด', 'กลุ่มงานทันตกรรม', 'ตรวจสอบแล้วพบว่าแบตเตอรี่เสื่อมสภาพ ทำการเปลี่ยนแบตเตอรี่ให้ใหม่', '2298', '2022-05-09 10:52:39', '2298', '2022-05-09 10:53:22', 1);
INSERT INTO `todolist` VALUES (22, '2298', 'เสียบไฟแล้วเปิดเครื่องสำรองไฟไม่ติด', 'ตึกพิเศษ 6 ชั้น 3', 'ตรวจสอบแล้วพบว่าแบตเตอรี่เสื่อมสภาพ ทำการเปลี่ยนแบตเตอรี่ให้ใหม่', '2298', '2022-05-09 10:53:42', '2298', '2022-05-09 10:53:50', 1);
INSERT INTO `todolist` VALUES (23, '2298', 'เครื่องสำรองไฟไม่เก็บไฟ', 'เวชระเบียนและสถิติ', 'ตรวจสอบแล้วพบว่าแบตเตอรี่เสื่อมสภาพ ทำการเปลี่ยนแบตเตอรี่ให้ใหม่', '2298', '2022-05-09 14:20:42', '2298', '2022-05-09 14:49:12', 1);
INSERT INTO `todolist` VALUES (24, '2298', 'ใช้งานคอมพิวเตอร์อยู่ แล้วก็ดับไป', 'กลุ่มงานทันตกรรม', 'ตรวจสอบแล้วพบว่า Out Put ช่องไฟออกจากเครื่องสำรองไฟเสีย 1 ช่อง ทำการย้ายช่องเสียบ และทำการหาเทปกาวปิดช่องที่เสียไว้', '2298', '2022-05-09 15:14:25', '2298', '2022-05-09 15:17:00', 1);
INSERT INTO `todolist` VALUES (25, '2298', 'เครื่องสำรองไฟมีเสียงดังตลอดเวลา', 'กลุ่มงานทันตกรรม', 'ไปตรวจสอบแล้วพบว่า ปล้ั๊กไฟที่เครื่องสำรองไฟเสียบอยู่นั้นหลวม จึงทำให้ไฟเข้าบ้าง หลุดบ้างเป็นเหตุให้เครื่องร้อง', '2298', '2022-05-09 16:29:50', '2298', '2022-05-09 16:30:17', 1);
INSERT INTO `todolist` VALUES (26, '2298', 'ทอสอบ', 'ทอสอบ', 'ทอสอบ', '2298', '2022-05-09 16:36:34', '2298', '2022-05-09 16:37:42', 9);
INSERT INTO `todolist` VALUES (27, '2298', 'ทอสอบ 2', 'ทอสอบ 2', 'ทดสอบ 2', '2298', '2022-05-09 16:38:00', '2298', '2022-05-09 16:38:17', 9);
INSERT INTO `todolist` VALUES (28, '2298', 'เครื่องปริ้น สั่งปริ้นไม่ออก', 'ห้องผ่าตัด', 'ตรวจสอบแล้วพบว่าการ connect มีปัญหา จึงทำการ connect ใหม่ให้อีกรอบ', '2298', '2022-05-11 13:05:05', '2298', '2022-05-11 13:06:13', 1);
INSERT INTO `todolist` VALUES (29, '2298', 'อยากให้ภาพหน้าจอใหญ่ขึ้น', 'ICU', 'ขยายสัดส่วนของภาพหน้าจอเพิ่มขึ้นเป็น 125%', '2298', '2022-05-11 16:07:52', '2298', '2022-05-11 16:08:32', 1);
INSERT INTO `todolist` VALUES (30, '2298', 'ประชุม', 'อาคาร 50 ปี ชั้น 4', 'เข้าร่วมประชุมเรื่อง user manual iot temperature monitoring device', '2298', '2022-05-11 16:09:18', '2298', '2022-05-11 16:10:22', 1);
INSERT INTO `todolist` VALUES (31, '2298', 'ดูระบบการเดินสายแลน', 'ตึกสงฆ์', 'วางระบบ HUB (สวิตซ์ฮับ) ให้ 2 ที่เพื่อเชื่อมต่ออินเตอร์เน็ต และเดินสายแลนจากเครื่อง user ไป HUB', '2298', '2022-05-12 09:03:56', '2298', '2022-05-12 14:35:32', 1);
INSERT INTO `todolist` VALUES (32, '2298', 'เครื่องสำรองไฟมีปัญหา เปิดไม่ติด', 'บัญชี', NULL, '2298', '2022-05-12 14:36:12', '2298', '2022-05-12 14:55:23', 9);
INSERT INTO `todolist` VALUES (33, '2298', 'คอมจอฟ้า', 'กลุ่มงานการเงิน', 'แก้ไขตามขึ้นตอนของ windows', '2298', '2022-05-12 14:57:17', '2298', '2022-05-12 14:57:52', 1);
INSERT INTO `todolist` VALUES (34, '2298', 'เดินสายแลนเพิ่มเติม', 'ตึกสงฆ์', 'เดินสายแลนเพิ่มเติมให้อีก 3 เครื่อง', '2298', '2022-05-12 16:48:05', '2298', '2022-05-12 16:48:24', 1);
INSERT INTO `todolist` VALUES (35, '2298', 'สั่งปริ้นแล้วปริ้นไม่ออก', 'ER', 'ตั้ง default เครื่องปริ้นให้ใหม่', '2298', '2022-05-17 08:47:09', '2298', '2022-05-17 08:49:31', 1);
INSERT INTO `todolist` VALUES (36, '2298', 'เครื่องปริ้น ปริ้นสีไม่ออกทุกสี', 'โรงกลั่น', 'ล้างหัวหมึก', '2298', '2022-05-17 09:40:05', '2298', '2022-05-17 09:41:01', 1);
INSERT INTO `todolist` VALUES (37, '2298', 'เดินสายแลนเพิ่มเติม เนื่องจากปรับเปลี่ยนโต๊ะทำงาน', 'ตึกสงฆ์', 'เดินเพิ่มเติมอีก 3 เครื่อง', '2298', '2022-05-17 10:57:50', '2298', '2022-05-17 11:00:02', 1);
INSERT INTO `todolist` VALUES (38, '2298', 'เครื่องสำรองไฟไม่เก็บไฟ', 'ตึกสงฆ์', 'ตรวจสอบแล้วพบว่าแบตเตอรี่เสื่อมสภาพ ทำการเปลี่ยนแบตเตอรี่ให้ใหม่', '2298', '2022-05-17 11:00:24', '2298', '2022-05-17 11:37:09', 1);
INSERT INTO `todolist` VALUES (39, '2298', 'เครื่อง smartcard reader ใช้งานไม่ได้', 'ตึกสงฆ์', 'ตรวจสอบแล้วพบว่าเสีย ไม่สามารถซ่อมแซมได้ เห็นควรจำหน่ายและเบิกเครื่องใหม่มาทดแทน', '2298', '2022-05-17 11:03:18', '2298', '2022-05-17 11:36:48', 1);
INSERT INTO `todolist` VALUES (40, '2298', 'เครื่องสำรองไฟเกิดการช็อต และเกิดไฟลุกไหม้', 'ตึกสงฆ์', 'ทำการจำหน่ายเครื่องคืนหน่วยงานพัสดุ เนื่องจากไม่สามารถซ่อมแซมได้', '2298', '2022-05-17 11:04:16', '2298', '2022-05-17 11:36:09', 1);
INSERT INTO `todolist` VALUES (41, '2298', 'คอมชอบดับเอง', 'ห้องตรวจนรีเวช', 'เบื้องต้นแกะเครื่องตรวจสอบดูแล้วปกติดี ไม่มีอะไรเสียหาย น่าจะเกิดจากความร้อนที่มากเกินไป เนื่องจากบริเวณนั้นมีสิ่งของวางไว้แน่น จึงทำให้การระบายอากาศไม่ดีนัก', '2298', '2022-05-17 16:36:37', '2298', '2022-05-17 16:38:46', 1);
INSERT INTO `todolist` VALUES (42, '2298', 'เครื่องปริ้นมีไฟกระพริบสองดวงพร้อมกัน', 'อายุกรรมชาย', 'เบื้องต้นแก้ไขตามคู่มือของทางเครื่องปริ้นแนะนำ จึงกลับมาใช้งานได้เหมือนเดิม', '2298', '2022-05-18 09:22:04', '2298', '2022-05-18 09:24:42', 1);
INSERT INTO `todolist` VALUES (43, '2298', 'หมึกเครื่องปริ้นหมด', 'อายุกรรมชาย', 'เติมน้ำหมึกให้ทุกสี พร้อมล้างหัวหมึก และปริ้นทดสอบให้ดู', '2298', '2022-05-18 09:22:42', '2298', '2022-05-18 09:26:19', 1);
INSERT INTO `todolist` VALUES (44, '2298', 'login เข้าเว็บไซต์โรงบาลไม่ได้', 'cohort', 'ตรวจสอบแล้วเบื้องต้นพบว่าพนักงานกรอก password ผิด จึงกรอก password ที่ถูกต้องให้ พร้อมแจ้ง password ที่ถูกต้องให้ทราบ และสามารถเข้าใช้งานระบบได้ตามปกติ', '2298', '2022-05-18 14:54:29', '2298', '2022-05-18 14:57:19', 1);
INSERT INTO `todolist` VALUES (45, '2298', 'Hosxp ใช้งานอยู่แล้วมี alert error', 'ตึกสงฆ์', 'เบื้องต้นทำการ update ไฟล์ที่สมบูรณ์ให้ใหม่', '2298', '2022-05-19 12:23:36', '2298', '2022-05-19 12:26:30', 1);
INSERT INTO `todolist` VALUES (46, '2298', 'ไดร์เวอร์เครื่องปริ้นหาย', 'ตึกสงฆ์', 'connect ไดร์เวอร์เครื่องปริ้นจากอีกเครื่องให้', '2298', '2022-05-19 13:49:38', '2298', '2022-05-19 13:50:19', 1);
INSERT INTO `todolist` VALUES (47, '2298', 'เพิ่มผู้ป่วยใหม่ลงเตียงไม่ได้', 'ตึกพิเศษ 6 ชั้น 3', 'ตรวจสอบแล้วพบว่าไปเลือกห้องและเตียงที่เต็มแล้ว จึงไม่สามารถลงได้', '2298', '2022-05-19 15:30:01', '2298', '2022-05-19 15:30:46', 1);
INSERT INTO `todolist` VALUES (48, '2298', 'เครื่องปริ้นมีเสียงดัง', 'NICU', 'เบื้องต้นลองทำความสะอาดที่ตลับหมึก และลูกกลิ้งในส่วนต่างๆ และเมื่อทดสอบปริ้น พบว่าเสียงหายไปแล้ว', '2298', '2022-05-19 16:01:15', '2298', '2022-05-19 16:02:41', 1);
INSERT INTO `todolist` VALUES (49, '2298', 'ประชุมเรื่อง FTE', 'ห้องประชุม ข้างห้อง ผอ.', 'เข้าประชุมตั้งแต่เวลา 10:30 น. ถึง 12:20 น.', '2298', '2022-05-20 12:35:20', '2298', '2022-05-20 12:36:12', 1);
INSERT INTO `todolist` VALUES (50, '2298', 'ขอดูกล้อง CCTV', 'ร้าน All time', 'เบื้องต้นขออนุญาตหัวหน้า แล้วเมื่ออนุญาตก็เปิดกล้องให้ดู', '2298', '2022-05-20 17:52:42', '2298', '2022-05-20 17:55:13', 1);
INSERT INTO `todolist` VALUES (51, '2298', 'โปรแกรม firefox error เข้าใช้งานไม่ได้', 'เวชระเบียนและสถิติ', 'เบื้องต้นเปลี่ยนค่า default เป็น google chrome แทน และสามารถใช้งานได้ปกติ', '2298', '2022-05-20 18:30:35', '2298', '2022-05-20 18:59:45', 1);
INSERT INTO `todolist` VALUES (52, '2298', 'เครื่องปริ้น ปริ้นไม่ได้', 'อายุกรรมชาย', 'ตรวจสอบแล้วลองปิดเปิดเครื่องใหม่ และทำความสะอาดดรัมหมึก สามารถใช้งานได้ปกติ ', '2298', '2022-05-23 09:11:54', '2298', '2022-05-23 09:12:49', 1);
INSERT INTO `todolist` VALUES (53, '2298', 'microsoft office ใช้งานไม่ได้', 'การเจ้าหน้าที่', 'ตรวจสอบแล้วพบว่าผลิตภัณฑ์หมดอายุ จึงทำการอัพเดทให้ใช้งานได้', '2298', '2022-05-23 10:07:28', '2298', '2022-05-23 10:17:19', 1);
INSERT INTO `todolist` VALUES (54, '2298', 'scan เอกสารไม่ได้', 'ห้องบัตร', 'เบื้องต้นตรวจสอบแล้วพบว่า เครื่องมองไม่เป็นไดร์เวอร์ ลองรีเครื่องใหม่ 1 รอบ ก็สามารถกลับมาใช้งานได้', '2298', '2022-05-23 10:23:40', '2298', '2022-05-23 10:24:38', 1);
INSERT INTO `todolist` VALUES (55, '2298', 'คอมเปิดติดแล้วดับ', 'ศูนย์จ่ายกลาง', 'ตรวจสอบแล้วพบว่า RAM เสีย ทำการเปลี่ยน RAM สำรองไปให้ใช้งานชั่วคราว เพื่อรอให้ทางบริษัทนำ RAM ตัวใหม่มาเปลี่ยนให้', '2298', '2022-05-23 11:06:30', '2298', '2022-05-23 11:07:49', 1);
INSERT INTO `todolist` VALUES (56, '2298', 'จำ user password ไม่ได้', 'บริหาร', 'เปิด DB USERINFO ค้นหา พร้อมแจ้ง User Password', '2298', '2022-05-23 15:53:33', '2298', '2022-05-23 15:54:36', 1);
INSERT INTO `todolist` VALUES (57, '2298', 'ย้ายจุดเชื่อมต่ออินเตอร์เน็ต 20 เครื่อง', 'ตึกสงฆ์', 'ย้ายจุดเชื่อมต่ออินเตอร์เน็ต 20 เครื่อง', '2298', '2022-05-24 08:55:58', '2298', '2022-05-24 11:17:31', 1);

SET FOREIGN_KEY_CHECKS = 1;
